In [16]:
# import the datafile 
import pandas as pd
bank = pd.read_csv('./bank_churn.csv')
bank.shape

(10000, 14)

In [17]:
print(bank.head(20))

    RowNumber  CustomerId    Surname  CreditScore Geography  Gender  Age  \
0           1    15634602   Hargrave          619    France  Female   42
1           2    15647311       Hill          608     Spain  Female   41
2           3    15619304       Onio          502    France  Female   42
3           4    15701354       Boni          699    France  Female   39
4           5    15737888   Mitchell          850     Spain  Female   43
5           6    15574012        Chu          645     Spain    Male   44
6           7    15592531   Bartlett          822    France    Male   50
7           8    15656148     Obinna          376   Germany  Female   29
8           9    15792365         He          501    France    Male   44
9          10    15592389         H?          684    France    Male   27
10         11    15767821     Bearce          528    France    Male   31
11         12    15737173    Andrews          497     Spain    Male   24
12         13    15632264        Kay          476    France  Female   34
13         14    15691483       Chin          549    France  Female   25
14         15    15600882      Scott          635     Spain  Female   35
15         16    15643966    Goforth          616   Germany    Male   45
16         17    15737452      Romeo          653   Germany    Male   58
17         18    15788218  Henderson          549     Spain  Female   24
18         19    15661507    Muldrow          587     Spain    Male   45
19         20    15568982        Hao          726    France  Female   24

    Tenure    Balance  NumOfProducts  HasCrCard  IsActiveMember  \
0        2       0.00              1          1               1
1        1   83807.86              1          0               1
2        8  159660.80              3          1               0
3        1       0.00              2          0               0
4        2  125510.82              1          1               1
5        8  113755.78              2          1               0
6        7       0.00              2          1               1
7        4  115046.74              4          1               0
8        4  142051.07              2          0               1
9        2  134603.88              1          1               1
10       6  102016.72              2          0               0
11       3       0.00              2          1               0
12      10       0.00              2          1               0
13       5       0.00              2          0               0
14       7       0.00              2          1               1
15       3  143129.41              2          0               1
16       1  132602.88              1          1               0
17       9       0.00              2          1               1
18       6       0.00              1          0               0
19       6       0.00              2          1               1

    EstimatedSalary  Exited
0         101348.88       1
1         112542.58       0
2         113931.57       1
3          93826.63       0
4          79084.10       0
5         149756.71       1
6          10062.80       0
7         119346.88       1
8          74940.50       0
9          71725.73       0
10         80181.12       0
11         76390.01       0
12         26260.98       0
13        190857.79       0
14         65951.65       0
15         64327.26       0
16          5097.67       1
17         14406.41       0
18        158684.81       0
19         54724.03       0

In [18]:
bank.groupby(bank.Exited).count()

,RowNumber,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary
Exited,,,,,,,,,,,,,
0,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963,7963
1,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037,2037

In [19]:
# drop features that seem irrelevant
bank = bank.drop('RowNumber',axis=1).drop('CustomerId',axis=1).drop('Surname',axis=1)

In [20]:
# drop lines with unknown (NaN) values
bank = bank.dropna()
bank.shape

(10000, 11)

In [21]:
# use one-hot encoding for gender and geography
import numpy as np
bank = pd.get_dummies(bank,columns=['Gender','Geography'])

In [22]:
bank.head()

,CreditScore,Age,Tenure,Balance,NumOfProducts,HasCrCard,IsActiveMember,EstimatedSalary,Exited,Gender_Female,Gender_Male,Geography_France,Geography_Germany,Geography_Spain
0,619,42,2,0.00,1,1,1,101348.88,1,1,0,1,0,0
1,608,41,1,83807.86,1,0,1,112542.58,0,1,0,0,0,1
2,502,42,8,159660.80,3,1,0,113931.57,1,1,0,1,0,0
3,699,39,1,0.00,2,0,0,93826.63,0,1,0,1,0,0
4,850,43,2,125510.82,1,1,1,79084.10,0,1,0,0,0,1

In [32]:
# determine training set, test set and label
from sklearn.model_selection import train_test_split
X = bank.drop('Exited',axis=1)
y = bank['Exited']
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size=0.30)

In [33]:
# build model
from sklearn.ensemble import RandomForestClassifier
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [34]:
# predict label for test set
y_test2 = model.predict(X_test)

In [35]:
# determine accuracy
from sklearn.metrics import accuracy_score
accuracy_score(y_test, y_test2)

0.7976666666666666

In [27]:
# determine feature importances
print(X_train.columns)
print(model.feature_importances_)

Index(['CreditScore', 'Age', 'Tenure', 'Balance', 'NumOfProducts', 'HasCrCard',
       'IsActiveMember', 'EstimatedSalary', 'Gender_Female', 'Gender_Male',
       'Geography_France', 'Geography_Germany', 'Geography_Spain'],
      dtype='object')
[0.14189846 0.24525899 0.08368351 0.13988044 0.12383877 0.01798132
 0.04281104 0.14774467 0.00856338 0.00897691 0.01121407 0.01886766
 0.00928079]

In [28]:
# we now combine those two collections into a dataframe
imp = pd.DataFrame(model.feature_importances_,columns=['Importance'],index=X_train.columns). \
sort_values(by='Importance',ascending=False)

In [14]:
imp

                   Importance
Age                  0.236765
CreditScore          0.142251
EstimatedSalary      0.141392
Balance              0.139053
NumOfProducts        0.127299
Tenure               0.087609
IsActiveMember       0.044512
Geography_Germany    0.021731
HasCrCard            0.018381
Geography_France     0.011291
Gender_Female        0.010632
Geography_Spain      0.009810
Gender_Male          0.009273

In [15]:
# import numpy as np
bank['Agecat'] = np.floor(bank['Age']/10)*10
print(bank.head())

   CreditScore  Age  Tenure    Balance  NumOfProducts  HasCrCard  \
0          619   42       2       0.00              1          1
1          608   41       1   83807.86              1          0
2          502   42       8  159660.80              3          1
3          699   39       1       0.00              2          0
4          850   43       2  125510.82              1          1

   IsActiveMember  EstimatedSalary  Exited  Gender_Female  Gender_Male  \
0               1        101348.88       1              1            0
1               1        112542.58       0              1            0
2               0        113931.57       1              1            0
3               0         93826.63       0              1            0
4               1         79084.10       0              1            0

   Geography_France  Geography_Germany  Geography_Spain  Agecat
0                 1                  0                0    40.0
1                 0                  0                1    40.0
2                 1                  0                0    40.0
3                 1                  0                0    30.0
4                 0                  0                1    40.0

In [22]:
bank.groupby('Agecat')['Exited'].mean()

Agecat
10.0    0.061224
20.0    0.076005
30.0    0.108836
40.0    0.307869
50.0    0.560414
60.0    0.352000
70.0    0.102941
80.0    0.076923
90.0    0.000000
Name: Exited, dtype: float64